In [2]:
import pandas as pd

In [3]:
imdb_crew = pd.read_csv('data/zippedData/imdb.title.crew.csv.gz')
imdb_crew

           tconst                      directors              writers
0       tt0285252                      nm0899854            nm0899854
1       tt0438973                            NaN  nm0175726,nm1802864
2       tt0462036                      nm1940585            nm1940585
3       tt0835418                      nm0151540  nm0310087,nm0841532
4       tt0878654  nm0089502,nm2291498,nm2292011            nm0284943
...           ...                            ...                  ...
146139  tt8999974                     nm10122357           nm10122357
146140  tt9001390                      nm6711477            nm6711477
146141  tt9001494          nm10123242,nm10123248                  NaN
146142  tt9004986                      nm4993825            nm4993825
146143  tt9010172                            NaN            nm8352242

[146144 rows x 3 columns]

In [5]:
imdb_crew.directors = imdb_crew.directors.str.split(',')
imdb_crew.dropna(subset=['directors'], inplace=True)
imdb_direct_ratings=imdb_crew.explode('directors')

In [6]:
imdb_direct_ratings

           tconst   directors              writers
0       tt0285252   nm0899854            nm0899854
2       tt0462036   nm1940585            nm1940585
3       tt0835418   nm0151540  nm0310087,nm0841532
4       tt0878654   nm0089502            nm0284943
4       tt0878654   nm2291498            nm0284943
...           ...         ...                  ...
146139  tt8999974  nm10122357           nm10122357
146140  tt9001390   nm6711477            nm6711477
146141  tt9001494  nm10123242                  NaN
146141  tt9001494  nm10123248                  NaN
146142  tt9004986   nm4993825            nm4993825

[163535 rows x 3 columns]

In [20]:
imdb_crew.isna().sum()

tconst       0
directors    0
writers      0
dtype: int64

In [13]:
imdb_direct_ratings.to_csv('data/direct_rating.csv', index=False)

In [8]:
imdb_direct_ratings

           tconst   directors              writers
0       tt0285252   nm0899854            nm0899854
2       tt0462036   nm1940585            nm1940585
3       tt0835418   nm0151540  nm0310087,nm0841532
4       tt0878654   nm0089502            nm0284943
4       tt0878654   nm2291498            nm0284943
...           ...         ...                  ...
146139  tt8999974  nm10122357           nm10122357
146140  tt9001390   nm6711477            nm6711477
146141  tt9001494  nm10123242                  NaN
146141  tt9001494  nm10123248                  NaN
146142  tt9004986   nm4993825            nm4993825

[163535 rows x 3 columns]

In [9]:
imdb_direct_ratings.duplicated().sum()

0

In [11]:
imdb_ratings = pd.read_csv('data/zippedData/imdb.title.ratings.csv.gz')
imdb_ratings

           tconst  averagerating  numvotes
0      tt10356526            8.3        31
1      tt10384606            8.9       559
2       tt1042974            6.4        20
3       tt1043726            4.2     50352
4       tt1060240            6.5        21
...           ...            ...       ...
73851   tt9805820            8.1        25
73852   tt9844256            7.5        24
73853   tt9851050            4.7        14
73854   tt9886934            7.0         5
73855   tt9894098            6.3       128

[73856 rows x 3 columns]

In [10]:
imdb_ratings.isna().sum()

tconst           0
averagerating    0
numvotes         0
dtype: int64

In [11]:
imdb_ratings.duplicated().sum()

0

In [12]:
imdb_movie_ratings = imdb_ratings.copy(deep=True)
imdb_movie_ratings

           tconst  averagerating  numvotes
0      tt10356526            8.3        31
1      tt10384606            8.9       559
2       tt1042974            6.4        20
3       tt1043726            4.2     50352
4       tt1060240            6.5        21
...           ...            ...       ...
73851   tt9805820            8.1        25
73852   tt9844256            7.5        24
73853   tt9851050            4.7        14
73854   tt9886934            7.0         5
73855   tt9894098            6.3       128

[73856 rows x 3 columns]

In [15]:
imdb_director_ratings = pd.merge(imdb_direct_ratings, imdb_movie_ratings, on='tconst' )
# imdb_direct_ratings.drop(['tconst', 'writers_x', 'writers_y', 'numvotes', 'tconst', 'writers',
#                          'directors_x', 'directors_y'], axis=1, inplace=True)
imdb_director_ratings

          tconst  directors              writers  averagerating  numvotes
0      tt0285252  nm0899854            nm0899854            3.9       219
1      tt0462036  nm1940585            nm1940585            5.5        18
2      tt0835418  nm0151540  nm0310087,nm0841532            5.0      8147
3      tt0878654  nm0089502            nm0284943            5.8       875
4      tt0878654  nm2291498            nm0284943            5.8       875
...          ...        ...                  ...            ...       ...
86026  tt8948614  nm0827830                  NaN            7.4       696
86027  tt8948614  nm0839064                  NaN            7.4       696
86028  tt8954732  nm0737517  nm0076820,nm2997602            6.0     13993
86029  tt8991416  nm7731173            nm7731173            6.7        13
86030  tt9004986  nm4993825            nm4993825            8.4         7

[86031 rows x 5 columns]